II/collins_with_kernel/oldroyd_B/tutorial/0/tau_p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      tau_p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0 0 0 0);

boundaryField
{
    inlet_north
    {
        type            fixedValue;
        value           uniform (0 0 0 0 0 0);
    }
    inlet_south
    {
        type            fixedValue;
        value           uniform (0 0 0 0 0 0);
    }
    outlet_east
    {
        type            zeroGradient;
    }
    outlet_west
    {
        type            zeroGradient;
    }
    walls
    {
        type            linearExtrapolation;
        value           uniform (0 0 0 0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
